modules/admin/controllers/AyahController.php

    public function actionIndex()
    {
        $this->view->title = 'Oyatlar';
        $surahId = Yii::$app->request->get('surah_id');
        $query = Ayah::find()->with('surah')->orderBy('surah_id ASC, number ASC');
        if ($surahId) $query->where(['surah_id' => $surahId]);
        $models = $query->limit(100)->all();
        $surahs = Surah::find()->orderBy('number ASC')->all();
---
SELECT * FROM `ayah` ORDER BY `surah_id`, `number` LIMIT 100
SELECT * FROM `surah` WHERE `id` IN (1, 2)
SELECT * FROM `surah` ORDER BY `number`