modules/admin/controllers/DefaultController.php

SELECT COUNT(*) FROM `user`
SELECT COUNT(*) FROM `arabic_letter`
SELECT COUNT(*) FROM `muallimi_lesson`
SELECT COUNT(*) FROM `tajweed_rule`
SELECT COUNT(*) FROM `surah`
SELECT COUNT(*) FROM `quiz`
SELECT * FROM `user` ORDER BY `created_at` DESC LIMIT 5
---
    public function actionIndex()
    {
        $this->view->title = 'Dashboard';
        $stats = [
            'users'    => User::find()->count(),
            'letters'  => ArabicLetter::find()->count(),
            'lessons'  => MuallimiLesson::find()->count(),
            'tajweed'  => TajweedRule::find()->count(),
            'surahs'   => Surah::find()->count(),
            'quizzes'  => Quiz::find()->count(),
        ];
        $recentUsers = User::find()->orderBy('created_at DESC')->limit(5)->all();