modules/admin/controllers/LessonController.php

SELECT * FROM `muallimi_lesson` ORDER BY `chapter_id`, `sort_order`
---
    public function actionIndex()
    {
        $this->view->title = 'Darslar';
        $models = MuallimiLesson::find()->with('chapter')->orderBy('chapter_id ASC, sort_order ASC')->all();

SELECT * FROM `muallimi_lesson` WHERE `id`='1'
SELECT * FROM `muallimi_chapter` ORDER BY `sort_order`
---
    public function actionUpdate($id)
    {
        $model = MuallimiLesson::findOne($id) ?? throw new NotFoundHttpException();
        $this->view->title = 'Dars tahrirlash';
        $chapters = MuallimiChapter::find()->orderBy('sort_order ASC')->all();