modules/admin/controllers/LetterController.php

SELECT * FROM `arabic_letter` ORDER BY `sort_order`
---
    public function actionIndex()
    {
        $this->view->title = 'Arab Harflari';
        $models = ArabicLetter::find()->orderBy('sort_order ASC')->all();