modules/admin/controllers/QuizController.php

SELECT * FROM `quiz` ORDER BY `id` DESC
---
    public function actionIndex()
    {
        $this->view->title = 'Testlar';
        $models = Quiz::find()->with('options')->orderBy('id DESC')->all();