modules/admin/controllers/SurahController.php

SELECT * FROM `surah` ORDER BY `number`
---
    public function actionIndex()
    {
        $this->view->title = 'Suralar';
        $models = Surah::find()->orderBy('number ASC')->all();