modules/admin/controllers/TajweedController.php

    public function actionIndex()
    {
        $this->view->title = 'Tajvid Qoidalari';
        $models = TajweedRule::find()->orderBy('sort_order ASC')->all();
---
SELECT * FROM `tajweed_rule` ORDER BY `sort_order`