modules/admin/controllers/VocabularyController.php

SELECT * FROM `vocabulary` ORDER BY `id` DESC
---
    public function actionIndex()
    {
        $this->view->title = "Lug'at";
        $models = Vocabulary::find()->orderBy('id DESC')->all();