views/profile/index.php

        <h6 style="font-weight:700;color:var(--dark-text);margin-bottom:1.25rem">Muallimi Soniy — Progress</h6>
        <?php foreach ($chapters as $ch): ?>
        <?php
            $total = \app\models\MuallimiLesson::find()->where(['chapter_id' => $ch->id])->count();
            $done  = \app\models\UserProgress::find()->where([
                'user_id' => $user->id, 'content_type' => 'lesson', 'completed' => 1
            ])->andWhere(['in', 'content_id',
                \app\models\MuallimiLesson::find()->select('id')->where(['chapter_id' => $ch->id])->column()
---
SELECT COUNT(*) FROM `muallimi_lesson` WHERE `chapter_id`=1
SELECT `id` FROM `muallimi_lesson` WHERE `chapter_id`=1