views/lesson/view.php

SELECT COUNT(*) FROM `quiz` WHERE `lesson_id`=30
---
        <?php else: ?><span></span><?php endif; ?>

        <div class="d-flex" style="gap:0.75rem">
            <?php $quizzes = $lesson->getQuizzes()->count(); if ($quizzes): ?>