controllers/LessonController.php

SELECT * FROM `muallimi_lesson` WHERE (`id`='30') AND (`active`=1)
---
    public function actionView($id)
    {
        $lesson = MuallimiLesson::findOne(['id' => $id, 'active' => 1]);