controllers/LetterController.php

SELECT `content_id` FROM `user_progress` WHERE (`user_id`=1) AND (`content_type`='letter') AND (`completed`=1)
---
    public function actionIndex()
    {
        $letters = ArabicLetter::getAllOrdered();
        $completed = [];
        if (!Yii::$app->user->isGuest) {
            $rows = UserProgress::find()
                ->where(['user_id' => Yii::$app->user->id, 'content_type' => 'letter', 'completed' => 1])
                ->select('content_id')->column();

SELECT * FROM `arabic_letter` WHERE `id`='1'
SELECT * FROM `arabic_letter` WHERE `sort_order` < 1 ORDER BY `sort_order` DESC
SELECT * FROM `arabic_letter` WHERE `sort_order` > 1 ORDER BY `sort_order`
---
    public function actionView($id)
    {
        $letter = ArabicLetter::findOne($id);
        if (!$letter) throw new NotFoundHttpException();

        $prev = ArabicLetter::find()->where(['<', 'sort_order', $letter->sort_order])->orderBy('sort_order DESC')->one();
        $next = ArabicLetter::find()->where(['>', 'sort_order', $letter->sort_order])->orderBy('sort_order ASC')->one();