controllers/ProfileController.php

SELECT COUNT(*) FROM `user_progress` WHERE (`user_id`=1) AND (`content_type`='lesson') AND (`completed`=1)
SELECT COUNT(*) FROM `user_progress` WHERE (`user_id`=1) AND (`content_type`='letter') AND (`completed`=1)
SELECT COUNT(*) FROM `quiz_result` WHERE `user_id`=1
SELECT COUNT(*) FROM `quiz_result` WHERE (`user_id`=1) AND (`is_correct`=1)
---
    public function actionIndex()
    {
        $user = Yii::$app->user->identity;
        $chapters = MuallimiChapter::getAllActive();

        $completedLessons = UserProgress::find()
            ->where(['user_id' => $user->id, 'content_type' => 'lesson', 'completed' => 1])
            ->count();
        $completedLetters = UserProgress::find()
            ->where(['user_id' => $user->id, 'content_type' => 'letter', 'completed' => 1])
            ->count();
        $totalQuizzes = QuizResult::find()->where(['user_id' => $user->id])->count();
        $correctQuizzes = QuizResult::find()->where(['user_id' => $user->id, 'is_correct' => 1])->count();