controllers/QuranController.php

    public function actionSurah($surah)
    {
        $s = Surah::findOne(['number' => $surah]);
        if (!$s) throw new NotFoundHttpException();
        $ayahs = Ayah::find()->where(['surah_id' => $s->id])->orderBy('number ASC')->all();
        $prev = Surah::find()->where(['<', 'number', $surah])->orderBy('number DESC')->one();
        $next = Surah::find()->where(['>', 'number', $surah])->orderBy('number ASC')->one();
---
SELECT * FROM `surah` WHERE `number`='1'
SELECT * FROM `ayah` WHERE `surah_id`=1 ORDER BY `number`
SELECT * FROM `surah` WHERE `number` < '1' ORDER BY `number` DESC
SELECT * FROM `surah` WHERE `number` > '1' ORDER BY `number`