controllers/SiteController.php

    public function actionIndex()
    {
        $chapters = MuallimiChapter::getAllActive();
        $letters = ArabicLetter::find()->orderBy('sort_order ASC')->limit(10)->all();
        $tajweedRules = TajweedRule::find()->where(['active' => 1])->limit(4)->orderBy('sort_order ASC')->all();
        $surahs = Surah::find()->orderBy('number ASC')->limit(10)->all();

        // User progress stats
        $completedLessons = 0;
        $lastLesson = null;
        if (!Yii::$app->user->isGuest) {
            $uid = Yii::$app->user->id;
            $completedLessons = UserProgress::find()
                ->where(['user_id' => $uid, 'content_type' => 'lesson', 'completed' => 1])
                ->count();
            $lastProgress = UserProgress::find()
                ->where(['user_id' => $uid, 'content_type' => 'lesson', 'completed' => 1])
                ->orderBy('completed_at DESC')->one();
            if ($lastProgress) {
                $lastLesson = MuallimiLesson::findOne($lastProgress->content_id);
            }
        }

        // Daily Ayah (changes each day based on day of year)
        $dailyAyah = null;
        try {
            $dayOfYear = (int)date('z') + 1;
            $totalAyahs = Ayah::find()->count();
            if ($totalAyahs > 0) {
                $ayahOffset = $dayOfYear % $totalAyahs;
                $dailyAyah = Ayah::find()
                    ->with('surah')
                    ->orderBy('id ASC')
                    ->offset($ayahOffset)
                    ->one();
---
SELECT * FROM `arabic_letter` ORDER BY `sort_order` LIMIT 10
SELECT * FROM `tajweed_rule` WHERE `active`=1 ORDER BY `sort_order` LIMIT 4
SELECT * FROM `surah` ORDER BY `number` LIMIT 10
SELECT COUNT(*) FROM `user_progress` WHERE (`user_id`=1) AND (`content_type`='lesson') AND (`completed`=1)
SELECT * FROM `user_progress` WHERE (`user_id`=1) AND (`content_type`='lesson') AND (`completed`=1) ORDER BY `completed_at` DESC
SELECT * FROM `muallimi_lesson` WHERE `id`=30
SELECT COUNT(*) FROM `ayah`
SELECT * FROM `surah` WHERE `id`=2

        }

        // Platform stats
        $totalLetters = ArabicLetter::find()->count();
        $totalSurahs  = Surah::find()->count();
        $totalLessons = \app\models\MuallimiLesson::find()->count();
---
SELECT COUNT(*) FROM `arabic_letter`
SELECT COUNT(*) FROM `surah`
SELECT COUNT(*) FROM `muallimi_lesson`