models/ArabicLetter.php

SELECT * FROM `arabic_letter` ORDER BY `sort_order`
---
    public static function getAllOrdered()
    {
        return static::find()->orderBy('sort_order ASC')->all();