models/MuallimiChapter.php

SELECT * FROM `muallimi_chapter` WHERE `active`=1 ORDER BY `sort_order`
---
    public static function getAllActive()
    {
        return static::find()->where(['active' => 1])->orderBy('sort_order ASC')->all();

SELECT COUNT(*) FROM `muallimi_lesson` WHERE (`chapter_id`=1) AND (`active`=1)
---
    public function getLessonCount()
    {
        return MuallimiLesson::find()->where(['chapter_id' => $this->id, 'active' => 1])->count();