models/MuallimiLesson.php

    public function getPrevLesson()
    {
        return static::find()
            ->where(['chapter_id' => $this->chapter_id, 'active' => 1])
            ->andWhere(['<', 'sort_order', $this->sort_order])
            ->orderBy('sort_order DESC')
            ->one();
---
SELECT * FROM `muallimi_lesson` WHERE ((`chapter_id`=8) AND (`active`=1)) AND (`sort_order` < 1) ORDER BY `sort_order` DESC

    public function getNextLesson()
    {
        return static::find()
            ->where(['chapter_id' => $this->chapter_id, 'active' => 1])
            ->andWhere(['>', 'sort_order', $this->sort_order])
            ->orderBy('sort_order ASC')
            ->one();
---
SELECT * FROM `muallimi_lesson` WHERE ((`chapter_id`=8) AND (`active`=1)) AND (`sort_order` > 1) ORDER BY `sort_order`