models/Surah.php

    public static function getAllOrdered()
    {
        return static::find()->orderBy('number ASC')->all();
---
SELECT * FROM `surah` ORDER BY `number`