models/TajweedRule.php

SELECT * FROM `tajweed_rule` WHERE `active`=1 ORDER BY `sort_order`
---
    public static function getAllActive()
    {
        return static::find()->where(['active' => 1])->orderBy('sort_order ASC')->all();