models/UserProgress.php

SELECT * FROM `user_progress` WHERE (`user_id`=1) AND (`content_id`='30') AND (`content_type`='lesson')
---
    public static function markComplete($userId, $contentId, $contentType)
    {
        $existing = static::findOne(['user_id' => $userId, 'content_id' => $contentId, 'content_type' => $contentType]);