models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'active' => 1]);
---
SELECT * FROM `user` WHERE (`id`=1) AND (`active`=1)